tap "clintmod/formulas"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Linux/OSX/FreeBSD resource monitor
brew "bpytop"
# Zstandard is a real-time compression algorithm
brew "zstd"
# GNU compiler collection
brew "gcc"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# TIFF library and utilities
brew "libtiff"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Development kit for the Java programming language
brew "openjdk"
# Command-line tool to manipulate Android App Bundles
brew "bundletool"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Configurable talking characters in ASCII art
brew "cowsay"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# GitHub command-line tool
brew "gh"
# AVH edition of git-flow
brew "git-flow-avh"
# Interactive command-line tool for using emoji in commit messages
brew "gitmoji"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Java-based project management
brew "maven"
# Node version management
brew "n"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Cross-shell prompt for astronauts
brew "starship"
# Programmatically correct mistyped console commands
brew "thefuck"
# JavaScript package manager
brew "yarn"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Application launcher and productivity software
cask "alfred"
# Voice and text chat software
cask "discord"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# GPU-based terminal emulator
cask "kitty"
# App to write, plan, collaborate, and get organized
cask "notion"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
vscode "abusaidm.html-snippets"
vscode "adpyke.vscode-sql-formatter"
vscode "ChakrounAnas.turbo-console-log"
vscode "codezombiech.gitignore"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "geequlim.godot-tools"
vscode "genieai.chatgpt-vscode"
vscode "GitHub.copilot"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-syntax"
vscode "k--kato.docomment"
vscode "kleber-swf.unity-code-snippets"
vscode "MariusAlchimavicius.json-to-ts"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vsliveshare.vsliveshare"
vscode "natqe.reload"
vscode "naumovs.color-highlight"
vscode "Orta.vscode-jest"
vscode "PKief.material-icon-theme"
vscode "poohcom1.csharp-prettier-docs"
vscode "Prisma.prisma"
vscode "Razoric.gdscript-toolkit-formatter"
vscode "redhat.java"
vscode "ritwickdey.LiveServer"
vscode "ronnidc.nunjucks"
vscode "styled-components.vscode-styled-components"
vscode "svelte.svelte-vscode"
vscode "Tobiah.unity-tools"
vscode "twxs.cmake"
vscode "Unity.unity-debug"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "Vue.volar"
vscode "waderyan.gitblame"
vscode "YclepticStudios.unity-snippets"
vscode "yzane.markdown-pdf"
