tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Linux/OSX/FreeBSD resource monitor
brew "bpytop"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Development kit for the Java programming language
brew "openjdk"
# Java-based project management
brew "maven"
# Platform built on V8 to build network applications
brew "node"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Cross-shell prompt for astronauts
brew "starship"
# JavaScript package manager
brew "yarn"
# Application launcher and productivity software
cask "alfred"
# Voice and text chat software
cask "discord"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# GPU-based terminal emulator
cask "kitty"
# App to write, plan, collaborate, and get organized
cask "notion"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
